"""
Реализовать функцию get_jokes(), возвращающую n шуток, сформированных из трех случайных слов, взятых из трёх списков (по одному из каждого):
nouns = ["автомобиль", "лес", "огонь", "город", "дом"]
adverbs = ["сегодня", "вчера", "завтра", "позавчера", "ночью"]
adjectives = ["веселый", "яркий", "зеленый", "утопичный", "мягкий"]
        Например:
get_jokes(2)
["лес завтра зеленый", "город вчера веселый"]
Документировать код функции.
Сможете ли вы добавить еще один аргумент — флаг, разрешающий или запрещающий повторы слов в шутках (когда каждое слово можно использовать только в одной шутке)? Сможете ли вы сделать аргументы именованными?

"""
import random

nouns = ["автомобиль", "лес", "огонь", "город", "дом"]
adverbs = ["сегодня", "вчера", "завтра", "позавчера", "ночью"]
adjectives = ["веселый", "яркий", "зеленый", "утопичный", "мягкий"]


def get_jokes(number_of_jokes):
    """
    Возвращает n шуток, сформированных из трех случайных слов, взятых из трёх списков (по одному из каждого):
    :param number_of_jokes: количество шуток
    :return: список с шутками
    """
    jokes = []
    for i in range(0, number_of_jokes):
        joke = random.choice(nouns) + " " + random.choice(adverbs) + " " + random.choice(adjectives)
        jokes.append(joke)
    return jokes


print(get_jokes(7))